app/controllers/songs_controller.rb

  def update
    @song = Song.find(params[:id])

    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "songs" SET "title" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Mr. Brightsides"], ["updated_at", "2016-06-01 16:08:04.887376"], ["id", 10]]